peng-zhihui/GRBL_for_STM32/Clion_Project/App/grbl/report.c
/*
  report.c - reporting and messaging methods
  Part of Grbl

  Copyright (c) 2012-2016 Sungeun K. Jeon for Gnea Research LLC
  Copyright (c) 2018-2019 Thomas Truong

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

/*
  This file functions as the primary feedback interface for Grbl. Any outgoing data, such
  as the protocol status messages, feedback messages, and status reports, are stored here.
  For the most part, these functions primarily are called from protocol.c methods. If a
  different style feedback is desired (i.e. JSON), then a user can change these following
  methods to accomodate their needs.
*/

#include "grbl.h"

// Internal report utilities to reduce flash with repetitive tasks turned into functions.
void report_util_setting_prefix(uint8_t n)
{
    serial_write('$');
    print_uint8_base10(n);
    serial_write('=');
}

static void report_util_line_feed()
{ printPgmString(PSTR("\r\n")); }

static void report_util_feedback_line_feed()
{
    serial_write(']');
    report_util_line_feed();
}

static void report_util_gcode_modes_G()
{ printPgmString(PSTR(" G")); }

static void report_util_gcode_modes_M()
{ printPgmString(PSTR(" M")); }

// static void report_util_comment_line_feed() { serial_write(')'); report_util_line_feed(); }
static void report_util_axis_values(float *axis_value)
{
    uint8_t idx;
    for (idx = 0; idx < N_AXIS; idx++)
    {
        printFloat_CoordValue(axis_value[idx]);
        if (idx < (N_AXIS - 1))
        { serial_write(','); }
    }
}

/*
static void report_util_setting_string(uint8_t n) {
  serial_write(' ');
  serial_write('(');
  switch(n) {
    case 0: printPgmString(PSTR("stp pulse")); break;
    case 1: printPgmString(PSTR("idl delay")); break; 
    case 2: printPgmString(PSTR("stp inv")); break;
    case 3: printPgmString(PSTR("dir inv")); break;
    case 4: printPgmString(PSTR("stp en inv")); break;
    case 5: printPgmString(PSTR("lim inv")); break;
    case 6: printPgmString(PSTR("prb inv")); break;
    case 10: printPgmString(PSTR("rpt")); break;
    case 11: printPgmString(PSTR("jnc dev")); break;
    case 12: printPgmString(PSTR("arc tol")); break;
    case 13: printPgmString(PSTR("rpt inch")); break;
    case 20: printPgmString(PSTR("sft lim")); break;
    case 21: printPgmString(PSTR("hrd lim")); break;
    case 22: printPgmString(PSTR("hm cyc")); break;
    case 23: printPgmString(PSTR("hm dir inv")); break;
    case 24: printPgmString(PSTR("hm feed")); break;
    case 25: printPgmString(PSTR("hm seek")); break;
    case 26: printPgmString(PSTR("hm delay")); break;
    case 27: printPgmString(PSTR("hm pulloff")); break;
    case 30: printPgmString(PSTR("rpm max")); break;
    case 31: printPgmString(PSTR("rpm min")); break;
    case 32: printPgmString(PSTR("laser")); break;
    default:
      n -= AXIS_SETTINGS_START_VAL;
      uint8_t idx = 0;
      while (n >= AXIS_SETTINGS_INCREMENT) {
        n -= AXIS_SETTINGS_INCREMENT;
        idx++;
      }
      serial_write(n+'x');
      switch (idx) {
        case 0: printPgmString(PSTR(":stp/mm")); break;
        case 1: printPgmString(PSTR(":mm/min")); break;
        case 2: printPgmString(PSTR(":mm/s^2")); break;
        case 3: printPgmString(PSTR(":mm max")); break;
      }
      break;
  }
  report_util_comment_line_feed();
}
*/

static void report_util_uint8_setting(uint8_t n, int val)
{
    report_util_setting_prefix(n);
    print_uint8_base10(val);
    report_util_line_feed(); // report_util_setting_string(n);
}

static void report_util_float_setting(uint8_t n, float val, uint8_t n_decimal)
{
    report_util_setting_prefix(n);
    printFloat(val, n_decimal);
    report_util_line_feed(); // report_util_setting_string(n);
}


// Handles the primary confirmation protocol response for streaming interfaces and human-feedback.
// For every incoming line, this method responds with an 'ok' for a successful command or an
// 'error:'  to indicate some error event with the line or some critical system error during
// operation. Errors events can originate from the g-code parser, settings module, or asynchronously
// from a critical error, such as a triggered hard limit. Interface should always monitor for these
// responses.
void report_status_message(uint8_t status_code)
{
    switch (status_code)
    {
        case STATUS_OK: // STATUS_OK
            printPgmString(PSTR("ok\r\n"));
            break;
        default:
            printPgmString(PSTR("error:"));
            print_uint8_base10(status_code);
            report_util_line_feed();
    }
}

// Prints alarm messages.
void report_alarm_message(uint8_t alarm_code)
{
    printPgmString(PSTR("ALARM:"));
    print_uint8_base10(alarm_code);
    report_util_line_feed();
    delay_ms(500); // Force delay to ensure message clears serial write buffer.
}

// Prints feedback messages. This serves as a centralized method to provide additional
// user feedback for things that are not of the status/alarm message protocol. These are
// messages such as setup warnings, switch toggling, and how to exit alarms.
// NOTE: For interfaces, messages are always placed within brackets. And if silent mode
// is installed, the message number codes are less than zero.
void report_feedback_message(uint8_t message_code)
{
    printPgmString(PSTR("[MSG:"));
    switch (message_code)
    {
        case MESSAGE_CRITICAL_EVENT:
            printPgmString(PSTR("Reset to continue"));
            break;
        case MESSAGE_ALARM_LOCK:
            printPgmString(PSTR("'$H'|'$X' to unlock"));
            break;
        case MESSAGE_ALARM_UNLOCK:
            printPgmString(PSTR("Caution: Unlocked"));
            break;
        case MESSAGE_ENABLED:
            printPgmString(PSTR("Enabled"));
            break;
        case MESSAGE_DISABLED:
            printPgmString(PSTR("Disabled"));
            break;
        case MESSAGE_SAFETY_DOOR_AJAR:
            printPgmString(PSTR("Check Door"));
            break;
        case MESSAGE_CHECK_LIMITS:
            printPgmString(PSTR("Check Limits"));
            break;
        case MESSAGE_PROGRAM_END:
            printPgmString(PSTR("Pgm End"));
            break;
        case MESSAGE_RESTORE_DEFAULTS:
            printPgmString(PSTR("Restoring defaults"));
            break;
        case MESSAGE_SPINDLE_RESTORE:
            printPgmString(PSTR("Restoring spindle"));
            break;
        case MESSAGE_SLEEP_MODE:
            printPgmString(PSTR("Sleeping"));
            break;
    }
    report_util_feedback_line_feed();
}


