peng-zhihui/GRBL_for_STM32/Clion_Project/App/grbl/report.c
// Welcome message
void report_init_message()
{
    printPgmString(PSTR("\r\nGrbl " GRBL_VERSION " ['$' for help]\r\n"));
}

// Grbl help message
void report_grbl_help()
{
    printPgmString(PSTR("[HLP:$$ $# $G $I $N $x=val $Nx=line $J=line $SLP $C $X $H ~ ! ? ctrl-x]\r\n"));
}


// Grbl global settings print out.
// NOTE: The numbering scheme here must correlate to storing in settings.c
void report_grbl_settings()
{
    // Print Grbl settings.
//  report_util_uint8_setting(0,settings.pulse_microseconds);
    report_util_float_setting(0, settings.fpulse_microseconds, N_DECIMAL_SETTINGVALUE);
    report_util_uint8_setting(1, settings.stepper_idle_lock_time);
    report_util_uint8_setting(2, settings.step_invert_mask);
    report_util_uint8_setting(3, settings.dir_invert_mask);
    report_util_uint8_setting(4, bit_istrue(settings.flags, BITFLAG_INVERT_ST_ENABLE));
    report_util_uint8_setting(5, bit_istrue(settings.flags, BITFLAG_INVERT_LIMIT_PINS));
    report_util_uint8_setting(6, bit_istrue(settings.flags, BITFLAG_INVERT_PROBE_PIN));
    report_util_uint8_setting(10, settings.status_report_mask);
    report_util_float_setting(11, settings.junction_deviation, N_DECIMAL_SETTINGVALUE);
    report_util_float_setting(12, settings.arc_tolerance, N_DECIMAL_SETTINGVALUE);
    report_util_uint8_setting(13, bit_istrue(settings.flags, BITFLAG_REPORT_INCHES));
    report_util_uint8_setting(20, bit_istrue(settings.flags, BITFLAG_SOFT_LIMIT_ENABLE));
    report_util_uint8_setting(21, bit_istrue(settings.flags, BITFLAG_HARD_LIMIT_ENABLE));
    report_util_uint8_setting(22, bit_istrue(settings.flags, BITFLAG_HOMING_ENABLE));
    report_util_uint8_setting(23, settings.homing_dir_mask);
    report_util_float_setting(24, settings.homing_feed_rate, N_DECIMAL_SETTINGVALUE);
    report_util_float_setting(25, settings.homing_seek_rate, N_DECIMAL_SETTINGVALUE);
    report_util_uint8_setting(26, settings.homing_debounce_delay);
    report_util_float_setting(27, settings.homing_pulloff, N_DECIMAL_SETTINGVALUE);
    report_util_float_setting(30, settings.rpm_max, N_DECIMAL_RPMVALUE);
    report_util_float_setting(31, settings.rpm_min, N_DECIMAL_RPMVALUE);
#ifdef VARIABLE_SPINDLE
    report_util_uint8_setting(32, bit_istrue(settings.flags, BITFLAG_LASER_MODE));
#else
    report_util_uint8_setting(32,0);
#endif

#ifdef ENABLE_ANALOG_OUTPUT
    report_util_float_setting(40, settings.analog_max, N_DECIMAL_SETTINGVALUE);
#endif

#ifdef VARIABLE_SPINDLE_ENABLE_PIN
    report_util_uint8_setting(50, settings.spindle_enable_pin_mode);
#endif




    // Print axis settings
    uint8_t idx, set_idx;
    uint8_t val = AXIS_SETTINGS_START_VAL;
    for (set_idx = 0; set_idx < AXIS_N_SETTINGS; set_idx++)
    {
        for (idx = 0; idx < N_AXIS; idx++)
        {
            switch (set_idx)
            {
                case 0:
                    report_util_float_setting(val + idx, settings.steps_per_mm[idx], N_DECIMAL_SETTINGVALUE);
                    break;
                case 1:
                    report_util_float_setting(val + idx, settings.max_rate[idx], N_DECIMAL_SETTINGVALUE);
                    break;
                case 2:
                    report_util_float_setting(val + idx, settings.eeacceleration[idx] / (60 * 60),
                                              N_DECIMAL_SETTINGVALUE);
                    break;
                case 3:
                    report_util_float_setting(val + idx, -settings.max_travel[idx], N_DECIMAL_SETTINGVALUE);
                    break;
            }
        }
        val += AXIS_SETTINGS_INCREMENT;
    }
}


// Prints current probe parameters. Upon a probe command, these parameters are updated upon a
// successful probe or upon a failed probe with the G38.3 without errors command (if supported).
// These values are retained until Grbl is power-cycled, whereby they will be re-zeroed.
void report_probe_parameters()
{
    // Report in terms of machine position.
    printPgmString(PSTR("[PRB:"));
    float print_position[N_AXIS];
    system_convert_array_steps_to_mpos(print_position, sys_probe_position);
    report_util_axis_values(print_position);
    serial_write(':');
    print_uint8_base10(sys.probe_succeeded);
    report_util_feedback_line_feed();
}


// Prints Grbl NGC parameters (coordinate offsets, probing)
void report_ngc_parameters()
{
    float coord_data[N_AXIS];
    uint8_t coord_select;
    for (coord_select = 0; coord_select <= SETTING_INDEX_NCOORD; coord_select++)
    {
        if (!(settings_read_coord_data(coord_select, coord_data)))
        {
            report_status_message(STATUS_SETTING_READ_FAIL);
            return;
        }
        printPgmString(PSTR("[G"));
        switch (coord_select)
        {
            case 6:
                printPgmString(PSTR("28"));
                break;
            case 7:
                printPgmString(PSTR("30"));
                break;
            default:
                print_uint8_base10(coord_select + 54);
                break; // G54-G59
        }
        serial_write(':');
        report_util_axis_values(coord_data);
        report_util_feedback_line_feed();
    }
    printPgmString(PSTR("[G92:")); // Print G92,G92.1 which are not persistent in memory
    report_util_axis_values(gc_state.coord_offset);
    report_util_feedback_line_feed();
    printPgmString(PSTR("[TLO:")); // Print tool length offset value
    printFloat_CoordValue(gc_state.tool_length_offset);
    report_util_feedback_line_feed();
    report_probe_parameters(); // Print probe parameters. Not persistent in memory.
}


// Print current gcode parser mode state
void report_gcode_modes()
{
    printPgmString(PSTR("[GC:G"));
    if (gc_state.modal.motion >= MOTION_MODE_PROBE_TOWARD)
    {
        printPgmString(PSTR("38."));
        print_uint8_base10(gc_state.modal.motion - (MOTION_MODE_PROBE_TOWARD - 2));
    } else
    {
        print_uint8_base10(gc_state.modal.motion);
    }

    report_util_gcode_modes_G();
    print_uint8_base10(gc_state.modal.coord_select + 54);

    report_util_gcode_modes_G();
    print_uint8_base10(gc_state.modal.plane_select + 17);

    report_util_gcode_modes_G();
    print_uint8_base10(21 - gc_state.modal.units);

    report_util_gcode_modes_G();
    print_uint8_base10(gc_state.modal.distance + 90);

    report_util_gcode_modes_G();
    print_uint8_base10(94 - gc_state.modal.feed_rate);

    if (gc_state.modal.program_flow)
    {
        report_util_gcode_modes_M();
        switch (gc_state.modal.program_flow)
        {
            case PROGRAM_FLOW_PAUSED :
                serial_write('0');
                break;
                // case PROGRAM_FLOW_OPTIONAL_STOP : serial_write('1'); break; // M1 is ignored and not supported.
            case PROGRAM_FLOW_COMPLETED_M2 :
            case PROGRAM_FLOW_COMPLETED_M30 :
                print_uint8_base10(gc_state.modal.program_flow);
                break;
        }
    }

    report_util_gcode_modes_M();
    switch (gc_state.modal.spindle)
    {
        case SPINDLE_ENABLE_CW :
            serial_write('3');
            break;
        case SPINDLE_ENABLE_CCW :
            serial_write('4');
            break;
        case SPINDLE_DISABLE :
            serial_write('5');
            break;
    }

#ifdef ENABLE_M7
    if (gc_state.modal.coolant)
    { // Note: Multiple coolant states may be active at the same time.
        if (gc_state.modal.coolant & PL_COND_FLAG_COOLANT_MIST)
        {
            report_util_gcode_modes_M();
            serial_write('7');
        }
        if (gc_state.modal.coolant & PL_COND_FLAG_COOLANT_FLOOD)
        {
            report_util_gcode_modes_M();
            serial_write('8');
        }
    } else
    {
        report_util_gcode_modes_M();
        serial_write('9');
    }
#else
    report_util_gcode_modes_M();
    if (gc_state.modal.coolant) { serial_write('8'); }
    else { serial_write('9'); }
#endif

