peng-zhihui/GRBL_for_STM32/Clion_Project/App/grbl/report.c
#ifdef ENABLE_PARKING_OVERRIDE_CONTROL
    if (sys.override_ctrl == OVERRIDE_PARKING_MOTION) { 
      report_util_gcode_modes_M();
      print_uint8_base10(56);
    }
#endif

    printPgmString(PSTR(" T"));
    print_uint8_base10(gc_state.tool);

    printPgmString(PSTR(" F"));
    printFloat_RateValue(gc_state.feed_rate);

#ifdef VARIABLE_SPINDLE
    printPgmString(PSTR(" S"));
    printFloat(gc_state.spindle_speed, N_DECIMAL_RPMVALUE);
#endif

    report_util_feedback_line_feed();
}

// Prints specified startup line
void report_startup_line(uint8_t n, char *line)
{
    printPgmString(PSTR("$N"));
    print_uint8_base10(n);
    serial_write('=');
    printString(line);
    report_util_line_feed();
}

void report_execute_startup_message(char *line, uint8_t status_code)
{
    serial_write('>');
    printString(line);
    serial_write(':');
    report_status_message(status_code);
}

// Prints build info line
void report_build_info(char *line)
{
    printPgmString(PSTR("[VER:" GRBL_VERSION "." GRBL_VERSION_BUILD ":"));
    printString(line);
    report_util_feedback_line_feed();
    printPgmString(PSTR("[OPT:")); // Generate compile-time build option list
#ifdef VARIABLE_SPINDLE
    serial_write('V');
#endif
#ifdef USE_LINE_NUMBERS
    serial_write('N');
#endif
#ifdef ENABLE_M7
    serial_write('M');
#endif
#ifdef COREXY
    serial_write('C');
#endif
#ifdef PARKING_ENABLE
    serial_write('P');
#endif
#ifdef HOMING_FORCE_SET_ORIGIN
    serial_write('Z');
#endif
#ifdef HOMING_SINGLE_AXIS_COMMANDS
    serial_write('H');
#endif
#ifdef LIMITS_TWO_SWITCHES_ON_AXES
    serial_write('T');
#endif
#ifdef ALLOW_FEED_OVERRIDE_DURING_PROBE_CYCLES
    serial_write('A');
#endif
#ifdef USE_SPINDLE_DIR_AS_ENABLE_PIN
    serial_write('D');
#endif
#ifdef SPINDLE_ENABLE_OFF_WITH_ZERO_SPEED
    serial_write('0');
#endif
#ifdef ENABLE_SOFTWARE_DEBOUNCE
    serial_write('S');
#endif
#ifdef ENABLE_PARKING_OVERRIDE_CONTROL
    serial_write('R');
#endif
#ifndef ENABLE_RESTORE_EEPROM_WIPE_ALL // NOTE: Shown when disabled.
    serial_write('*');
#endif
#ifndef ENABLE_RESTORE_EEPROM_DEFAULT_SETTINGS // NOTE: Shown when disabled.
    serial_write('$');
#endif
#ifndef ENABLE_RESTORE_EEPROM_CLEAR_PARAMETERS // NOTE: Shown when disabled.
    serial_write('#');
#endif
#ifndef ENABLE_BUILD_INFO_WRITE_COMMAND // NOTE: Shown when disabled.
    serial_write('I');
#endif
#ifndef FORCE_BUFFER_SYNC_DURING_EEPROM_WRITE // NOTE: Shown when disabled.
    serial_write('E');
#endif
#ifndef FORCE_BUFFER_SYNC_DURING_WCO_CHANGE // NOTE: Shown when disabled.
    serial_write('W');
#endif
#ifndef HOMING_INIT_LOCK
    serial_write('L');
#endif

    // NOTE: Compiled values, like override increments/max/min values, may be added at some point later.
    serial_write(',');
    print_uint8_base10(BLOCK_BUFFER_SIZE - 1);
    serial_write(',');
    print_uint8_base10(RX_BUFFER_SIZE);

    report_util_feedback_line_feed();
}


// Prints the character string line Grbl has received from the user, which has been pre-parsed,
// and has been sent into protocol_execute_line() routine to be executed by Grbl.
void report_echo_line_received(char *line)
{
    printPgmString(PSTR("[echo: "));
    printString(line);
    report_util_feedback_line_feed();
}


// Prints real-time data. This function grabs a real-time snapshot of the stepper subprogram
// and the actual location of the CNC machine. Users may change the following function to their
// specific needs, but the desired real-time data report must be as short as possible. This is
// requires as it minimizes the computational overhead and allows grbl to keep running smoothly,
// especially during g-code programs with fast, short line segments and high frequency reports (5-20Hz).
void report_realtime_status()
{
    uint8_t idx;
    int32_t current_position[N_AXIS]; // Copy current state of the system position variable
    memcpy(current_position, sys_position, sizeof(sys_position));
    float print_position[N_AXIS];
    system_convert_array_steps_to_mpos(print_position, current_position);

    // Report current machine state and sub-states
    serial_write('<');
    switch (sys.state)
    {
        case STATE_IDLE:
            printPgmString(PSTR("Idle"));
            break;
        case STATE_CYCLE:
            printPgmString(PSTR("Run"));
            break;
        case STATE_HOLD:
            if (!(sys.suspend & SUSPEND_JOG_CANCEL))
            {
                printPgmString(PSTR("Hold:"));
                if (sys.suspend & SUSPEND_HOLD_COMPLETE)
                { serial_write('0'); } // Ready to resume
                else
                { serial_write('1'); } // Actively holding
            } // Continues to print jog state during jog cancel.
            break;
        case STATE_JOG:
            printPgmString(PSTR("Jog"));
            break;
        case STATE_HOMING:
            printPgmString(PSTR("Home"));
            break;
        case STATE_ALARM:
            printPgmString(PSTR("Alarm"));
            break;
        case STATE_CHECK_MODE:
            printPgmString(PSTR("Check"));
            break;
        case STATE_SAFETY_DOOR:
            printPgmString(PSTR("Door:"));
            if (sys.suspend & SUSPEND_INITIATE_RESTORE)
            {
                serial_write('3'); // Restoring
            } else
            {
                if (sys.suspend & SUSPEND_RETRACT_COMPLETE)
                {
                    if (sys.suspend & SUSPEND_SAFETY_DOOR_AJAR)
                    {
                        serial_write('1'); // Door ajar
                    } else
                    {
                        serial_write('0');
                    } // Door closed and ready to resume
                } else
                {
                    serial_write('2'); // Retracting
                }
            }
            break;
        case STATE_SLEEP:
            printPgmString(PSTR("Sleep"));
            break;
    }

    float wco[N_AXIS];
    if (bit_isfalse(settings.status_report_mask, BITFLAG_RT_STATUS_POSITION_TYPE) ||
        (sys.report_wco_counter == 0))
    {
        for (idx = 0; idx < N_AXIS; idx++)
        {
            // Apply work coordinate offsets and tool length offset to current position.
            wco[idx] = gc_state.coord_system[idx] + gc_state.coord_offset[idx];
            if (idx == TOOL_LENGTH_OFFSET_AXIS)
            { wco[idx] += gc_state.tool_length_offset; }
            if (bit_isfalse(settings.status_report_mask, BITFLAG_RT_STATUS_POSITION_TYPE))
            {
                print_position[idx] -= wco[idx];
            }
        }
    }

    // Report machine position
    if (bit_istrue(settings.status_report_mask, BITFLAG_RT_STATUS_POSITION_TYPE))
    {
        printPgmString(PSTR("|MPos:"));
    } else
    {
        printPgmString(PSTR("|WPos:"));
    }
    report_util_axis_values(print_position);

    // Returns planner and serial read buffer states.
#ifdef REPORT_FIELD_BUFFER_STATE
    if (bit_istrue(settings.status_report_mask, BITFLAG_RT_STATUS_BUFFER_STATE))
    {
        printPgmString(PSTR("|Bf:"));
        print_uint8_base10(plan_get_block_buffer_available());
        serial_write(',');
        print_uint8_base10(serial_get_rx_buffer_available());
    }
#endif

#ifdef USE_LINE_NUMBERS
#ifdef REPORT_FIELD_LINE_NUMBERS
        // Report current line number
        plan_block_t * cur_block = plan_get_current_block();
        if (cur_block != NULL) {
          uint32_t ln = cur_block->line_number;
          if (ln > 0) {
            printPgmString(PSTR("|Ln:"));
            printInteger(ln);
          }
        }
#endif
#endif

        // Report realtime feed speed
#ifdef REPORT_FIELD_CURRENT_FEED_SPEED
#ifdef VARIABLE_SPINDLE
    printPgmString(PSTR("|FS:"));
    printFloat_RateValue(st_get_realtime_rate());
    serial_write(',');
    printFloat(sys.spindle_speed, N_DECIMAL_RPMVALUE);
#else
    printPgmString(PSTR("|F:"));
    printFloat_RateValue(st_get_realtime_rate());
#endif
#endif

