peng-zhihui/GRBL_for_STM32/Clion_Project/App/grbl/report.c
#ifdef REPORT_FIELD_PIN_STATE
    uint8_t lim_pin_state = limits_get_state();
    uint8_t ctrl_pin_state = system_control_get_state();
    uint8_t prb_pin_state = probe_get_state();
    if (lim_pin_state | ctrl_pin_state | prb_pin_state)
    {
        printPgmString(PSTR("|Pn:"));
        if (prb_pin_state)
        { serial_write('P'); }
        if (lim_pin_state)
        {
            if (bit_istrue(lim_pin_state, bit(X_AXIS)))
            { serial_write('X'); }
            if (bit_istrue(lim_pin_state, bit(Y_AXIS)))
            { serial_write('Y'); }
            if (bit_istrue(lim_pin_state, bit(Z_AXIS)))
            { serial_write('Z'); }
#if (defined(STM32F1_4) || defined(STM32F4_4))
            if (bit_istrue(lim_pin_state, bit(A_AXIS))) { serial_write('A'); }
#endif
#if (defined(STM32F1_5) || defined(STM32F4_5))
            if (bit_istrue(lim_pin_state, bit(A_AXIS))) { serial_write('A'); }
            if (bit_istrue(lim_pin_state, bit(B_AXIS))) { serial_write('B'); }
#endif
#if (defined(STM32F1_6) || defined(STM32F4_6))
            if (bit_istrue(lim_pin_state, bit(A_AXIS))) { serial_write('A'); }
            if (bit_istrue(lim_pin_state, bit(B_AXIS))) { serial_write('B'); }
            if (bit_istrue(lim_pin_state, bit(C_AXIS))) { serial_write('C'); }
#endif
        }
        if (ctrl_pin_state)
        {
#ifdef ENABLE_SAFETY_DOOR_INPUT_PIN
            if (bit_istrue(ctrl_pin_state, CONTROL_PIN_INDEX_SAFETY_DOOR))
            { serial_write('D'); }
#endif
            if (bit_istrue(ctrl_pin_state, CONTROL_PIN_INDEX_RESET))
            { serial_write('R'); }
            if (bit_istrue(ctrl_pin_state, CONTROL_PIN_INDEX_FEED_HOLD))
            { serial_write('H'); }
            if (bit_istrue(ctrl_pin_state, CONTROL_PIN_INDEX_CYCLE_START))
            { serial_write('S'); }
        }
    }
#endif

#ifdef REPORT_FIELD_WORK_COORD_OFFSET
    if (sys.report_wco_counter > 0)
    { sys.report_wco_counter--; }
    else
    {
        if (sys.state & (STATE_HOMING | STATE_CYCLE | STATE_HOLD | STATE_JOG | STATE_SAFETY_DOOR))
        {
            sys.report_wco_counter = (REPORT_WCO_REFRESH_BUSY_COUNT - 1); // Reset counter for slow refresh
        } else
        { sys.report_wco_counter = (REPORT_WCO_REFRESH_IDLE_COUNT - 1); }
        if (sys.report_ovr_counter == 0)
        { sys.report_ovr_counter = 1; } // Set override on next report.
        printPgmString(PSTR("|WCO:"));
        report_util_axis_values(wco);
    }
#endif

#ifdef REPORT_FIELD_OVERRIDES
    if (sys.report_ovr_counter > 0)
    { sys.report_ovr_counter--; }
    else
    {
        if (sys.state & (STATE_HOMING | STATE_CYCLE | STATE_HOLD | STATE_JOG | STATE_SAFETY_DOOR))
        {
            sys.report_ovr_counter = (REPORT_OVR_REFRESH_BUSY_COUNT - 1); // Reset counter for slow refresh
        } else
        { sys.report_ovr_counter = (REPORT_OVR_REFRESH_IDLE_COUNT - 1); }
        printPgmString(PSTR("|Ov:"));
        print_uint8_base10(sys.f_override);
        serial_write(',');
        print_uint8_base10(sys.r_override);
        serial_write(',');
        print_uint8_base10(sys.spindle_speed_ovr);

        uint8_t sp_state = spindle_get_state();
        uint8_t cl_state = coolant_get_state();
        if (sp_state || cl_state)
        {
            printPgmString(PSTR("|A:"));
            if (sp_state)
            { // != SPINDLE_STATE_DISABLE
#ifdef VARIABLE_SPINDLE
#ifdef USE_SPINDLE_DIR_AS_ENABLE_PIN
                serial_write('S'); // CW
#else
                if (sp_state == SPINDLE_STATE_CW)
                { serial_write('S'); } // CW
                else
                { serial_write('C'); } // CCW
#endif
#else
                if (sp_state & SPINDLE_STATE_CW) { serial_write('S'); } // CW
                else { serial_write('C'); } // CCW
#endif
            }
            if (cl_state & COOLANT_STATE_FLOOD)
            { serial_write('F'); }
#ifdef ENABLE_M7
            if (cl_state & COOLANT_STATE_MIST)
            { serial_write('M'); }
#endif
        }
    }
#endif

    serial_write('>');
    report_util_line_feed();
}


#ifdef DEBUG
void report_realtime_debug()
{

}
#endif
